[
    {
        "id": 1,
        "image": "img/booki.png",
        "alt": "Image du projet Booki disponible sur ma page Git",
        "title": "Booki",
        "description": "Transformer une maquette en site web avec HTML et CSS", 
        "competences": "Implémenter une interface responsive, Intégrer du contenu conformément à une maquette",
        "link": "https://github.com/mikl291/P2-Dev-Web-Booki"},
    {    
        "id": 2,
        "image": "img/ohmyfood.png",
        "alt": "Image du projet Ohmyfood disponible sur ma page Git",
        "title": "Oh My Food",
        "description": "Dynamiser une page web avec des animations CSS",
        "competences": "Mettre en œuvre des effets CSS graphiques avancés, Mettre en place une structure de navigation pour un site web, Assurer la cohérence graphique d'un site web, Utiliser un système de gestion de versions pour le suivi du projet et son hébergement, Mettre en place son environnement Front-End",
        "link": "https://github.com/mikl291/P3-Dev-Web-OhMyFood"},
    {    
        "id": 3,
        "image": "img/panthere.png",
        "alt": "Image du projet La Panthère disponible sur ma page Git",
        "title": "La Panthère",
        "description": "Optimiser un site existant.",
        "competences": "Assurer l'accessibilité d'un site web, Réaliser une recherche des bonnes pratiques en développement web, Optimiser le référencement d'un site web, Optimiser la taille et la vitesse d’un site web, Écrire un code HTML et CSS maintenable",
        "link": "https://github.com/mikl291/P4-Dev-Web-LaPanthere"},
    {
        "id": 4,
        "image": "img/kanap.png",
        "alt": "Image du projet Kanap disponible sur ma page Git",
        "title": "Kanap",
        "description": "Construire un site e-commerce en JAVASCRIPT "  ,
        "competences": "Créer un plan de test pour une application, Valider des données issues de sources externes, Interagir avec un web service avec JavaScript, Gérer des événements JavaScript",
        "link": "https://github.com/mikl291/P5-Dev-Web-Kanap"},
    {    
        "id": 5,
        "image": "img/piiquante.png",
        "alt": "Image du projet Piiquante disponible sur ma page Git",
        "title": "Piiquante",
        "description": "Construire une API sécurisée pour une application d'avis." ,
        "competences": "Assurer l'accessibilité d'un site web, Réaliser une recherche des bonnes pratiques en développement web, Optimiser le référencement d'un site web, Optimiser la taille et la vitesse d’un site web, Écrire un code HTML et CSS maintenable",
        "link": "https://github.com/mikl291/Web-Developer-P6"},
        
    {    
        "id": 6,
        "image": "img/kasa.png",
        "alt": "Image du projet Kasa disponible sur ma page Git",
        "title": "Kasa",
        "description": "Créer une application web de location avec REACT.",
        "competences": "Configurer la navigation entre les pages de l'application avec React Router, Développer des éléments de l'interface d'un site web grâce à des composants React, Initialiser une application avec Create React App",
        "link": "https://github.com/mikl291/P7-DEV-WEB-KASA"},
    {    
        "id": 7,
        "image": "img/cdv.webp",
        "alt": "Image du projet TY'Card disponible sur ma page Git",
        "title": "TY'Card",
        "description": "Création de visuel de communication." ,
        "competences": "Création de Supports de communications (carte de visite flyers...)",
        "link": "https://tyka29.github.io/tyka/"}
    
    
]
